lkolbly/cmsis-svd/data/TexasInstruments/LM3S9790.svd
        <register>
          <name>GPCS</name>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <fields>
            <field>
              <name>USB_GPCS_DEVMOD</name>
              <description>Device Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_GPCS_DEVMODOTG</name>
              <description>Enable Device Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDC</name>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000430</addressOffset>
          <fields>
            <field>
              <name>USB_VDC_VBDEN</name>
              <description>VBUS Droop Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCRIS</name>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000434</addressOffset>
          <fields>
            <field>
              <name>USB_VDCRIS_VD</name>
              <description>VBUS Droop Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCIM</name>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000438</addressOffset>
          <fields>
            <field>
              <name>USB_VDCIM_VD</name>
              <description>VBUS Droop Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCISC</name>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x0000043C</addressOffset>
          <fields>
            <field>
              <name>USB_VDCISC_VD</name>
              <description>VBUS Droop Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVRIS</name>
          <description>USB ID Valid Detect Raw Interrupt Status</description>
          <addressOffset>0x00000444</addressOffset>
          <fields>
            <field>
              <name>USB_IDVRIS_ID</name>
              <description>ID Valid Detect Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVIM</name>
          <description>USB ID Valid Detect Interrupt Mask</description>
          <addressOffset>0x00000448</addressOffset>
          <fields>
            <field>
              <name>USB_IDVIM_ID</name>
              <description>ID Valid Detect Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVISC</name>
          <description>USB ID Valid Detect Interrupt Status and Clear</description>
          <addressOffset>0x0000044C</addressOffset>
          <fields>
            <field>
              <name>USB_IDVISC_ID</name>
              <description>ID Valid Detect Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASEL</name>
          <description>USB DMA Select</description>
          <addressOffset>0x00000450</addressOffset>
          <fields>
            <field>
              <name>USB_DMASEL_DMAARX</name>
              <description>DMA A RX Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMAATX</name>
              <description>DMA A TX Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMABRX</name>
              <description>DMA B RX Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMABTX</name>
              <description>DMA B TX Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMACRX</name>
              <description>DMA C RX Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMACTX</name>
              <description>DMA C TX Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S0</name>
      <description>Register map for I2S0 peripheral</description>
      <groupName>I2S</groupName>
      <prependToName>I2S0</prependToName>
      <baseAddress>0x40054000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TXFIFO</name>
          <description>I2S Transmit FIFO Data</description>
          <addressOffset>0x00000000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2S_TXFIFO</name>
              <description>TX Data</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOCFG</name>
          <description>I2S Transmit FIFO Configuration</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2S_TXFIFOCFG_LRS</name>
              <description>Left-Right Sample Indicator</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_TXFIFOCFG_CSS</name>
              <description>Compact Stereo Sample Size</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCFG</name>
          <description>I2S Transmit Module Configuration</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>I2S_TXCFG_SDSZ</name>
              <description>System Data Size</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_SSZ</name>
              <description>Sample Size</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_MSL</name>
              <description>SCLK Master/Slave</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_FMT</name>
              <description>FIFO Empty</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_WM</name>
              <description>Write Mode</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S_TXCFG_WM_DUAL</name>
                  <description>Stereo mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_TXCFG_WM_COMPACT</name>
                  <description>Compact Stereo mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_TXCFG_WM_MONO</name>
                  <description>Mono mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_TXCFG_LRP</name>
              <description>Left/Right Clock Polarity</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_SCP</name>
              <description>SCLK Polarity</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_DLY</name>
              <description>Data Delay</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2S_TXCFG_JST</name>
              <description>Justification of Output Data</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXLIMIT</name>
          <description>I2S Transmit FIFO Limit</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>I2S_TXLIMIT_LIMIT</name>
              <description>FIFO Limit</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXISM</name>
          <description>I2S Transmit Interrupt Status and Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>I2S_TXISM_FFM</name>
              <description>FIFO Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_TXISM_FFI</name>
              <description>Transmit FIFO Service Request Interrupt</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXLEV</name>
          <description>I2S Transmit FIFO Level</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>I2S_TXLEV_LEVEL</name>
              <description>Number of Audio Samples</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFO</name>
          <description>I2S Receive FIFO Data</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>I2S_RXFIFO</name>
              <description>RX Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOCFG</name>
          <description>I2S Receive FIFO Configuration</description>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2S_RXFIFOCFG_LRS</name>
              <description>Left-Right Sample Indicator</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_RXFIFOCFG_CSS</name>
              <description>Compact Stereo Sample Size</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2S_RXFIFOCFG_FMM</name>
              <description>FIFO Mono Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCFG</name>
          <description>I2S Receive Module Configuration</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>I2S_RXCFG_SDSZ</name>
              <description>System Data Size</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_SSZ</name>
              <description>Sample Size</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_MSL</name>
              <description>SCLK Master/Slave</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_RM</name>
              <description>Read Mode</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_LRP</name>
              <description>Left/Right Clock Polarity</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_SCP</name>
              <description>SCLK Polarity</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_DLY</name>
              <description>Data Delay</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>I2S_RXCFG_JST</name>
              <description>Justification of Input Data</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXLIMIT</name>
          <description>I2S Receive FIFO Limit</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>I2S_RXLIMIT_LIMIT</name>
              <description>FIFO Limit</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXISM</name>
          <description>I2S Receive Interrupt Status and Mask</description>
          <addressOffset>0x00000810</addressOffset>
          <fields>
            <field>
              <name>I2S_RXISM_FFM</name>
              <description>FIFO Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_RXISM_FFI</name>
              <description>Receive FIFO Service Request Interrupt</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXLEV</name>
          <description>I2S Receive FIFO Level</description>
          <addressOffset>0x00000818</addressOffset>
          <fields>
            <field>
              <name>I2S_RXLEV_LEVEL</name>
              <description>Number of Audio Samples</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>I2S Module Configuration</description>
          <addressOffset>0x00000C00</addressOffset>
          <fields>
            <field>
              <name>I2S_CFG_TXEN</name>
              <description>Serial Transmit Engine Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_CFG_RXEN</name>
              <description>Serial Receive Engine Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2S_CFG_TXSLV</name>
              <description>Use External I2S0TXMCLK</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2S_CFG_RXSLV</name>
              <description>Use External I2S0RXMCLK</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>I2S Interrupt Mask</description>
          <addressOffset>0x00000C10</addressOffset>
          <fields>
            <field>
              <name>I2S_IM_TXFSR</name>
              <description>Transmit FIFO Service Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_IM_TXWE</name>
              <description>Transmit FIFO Write Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2S_IM_RXFSR</name>
              <description>Receive FIFO Service Request</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2S_IM_RXRE</name>
              <description>Receive FIFO Read Error</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>I2S Raw Interrupt Status</description>
          <addressOffset>0x00000C14</addressOffset>
          <fields>
            <field>
              <name>I2S_RIS_TXFSR</name>
              <description>Transmit FIFO Service Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_RIS_TXWE</name>
              <description>Transmit FIFO Write Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2S_RIS_RXFSR</name>
              <description>Receive FIFO Service Request</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2S_RIS_RXRE</name>
              <description>Receive FIFO Read Error</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>I2S Masked Interrupt Status</description>
          <addressOffset>0x00000C18</addressOffset>
          <fields>
            <field>
              <name>I2S_MIS_TXFSR</name>
              <description>Transmit FIFO Service Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2S_MIS_TXWE</name>
              <description>Transmit FIFO Write Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2S_MIS_RXFSR</name>
              <description>Receive FIFO Service Request</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2S_MIS_RXRE</name>
              <description>Receive FIFO Read Error</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>I2S Interrupt Clear</description>
          <addressOffset>0x00000C1C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2S_IC_TXWE</name>
              <description>Transmit FIFO Write Error</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2S_IC_RXRE</name>
              <description>Receive FIFO Read Error</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
